//-----------------------------------------------------------------
// 名称: ADC0832模数转换程序
//-----------------------------------------------------------------
#include <intrins.h>
#include <reg51.h>
#define INT8U unsigned char
#define INT16U unsigned int
//ADC0832引脚定义
sbit  CS   =  P3^4;					//片选线(电路中固定连接低电平)
sbit  CLK  =  P3^5;					//时钟钟线
sbit  DIO  =  P3^7;					//数据线
//-----------------------------------------------------------------
// 获取指定通道的A/D转换结果
//-----------------------------------------------------------------
INT8U ADx_Value(INT8U ch)
{


}