//-----------------------------------------------------------------
//  名称: 红外遥控器接收程序
//-----------------------------------------------------------------
//  说明: 程序运行时,根据SONY红外协议接收数据并解码,然后将12位编码
//		以16进制数显示LCD上.
//  
//-----------------------------------------------------------------
#include <reg51.h>
#include <string.h>
#include <intrins.h>
#include <stdio.h>
#define INT8U  unsigned char
#define INT16U unsigned int
INT8U Disp_Buffer[17];		//显示缓冲
sbit Read_IR = P3^2;		//读取红外输入信号
//接收到的12位红外编码及上次接收的编码
volatile INT16U IR_D12 = 0x000, Old_IR_D12 = 0x000; 
volatile INT16U IR_us = 0;	//红外载波时长
extern delay_ms(INT16U x);
extern void Initialize_LCD();
extern void LCD_ShowString(INT8U,INT8U,INT8U *);  
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{


}

//-----------------------------------------------------------------
// INT0中断函数 (通过实测,以70,140为两个时长的上限)
//-----------------------------------------------------------------
void  IR_INT_ISR() interrupt 0
{



}