//-----------------------------------------------------------------
//	名称: 用兼容I2C接口的MAX6955驱动16段数码管显示
//-----------------------------------------------------------------
//	说明: 本例运行时,8只16段数码滚动显示数字0~9,字母A~Z
//		  本例使MAX6955工作于全解码模式,因此只需要向MAX6955输出
//		  待显示字符ASCII码即可,不需要编写并发送各字符的段码.
//
//----------Proteus中单只16段数码管上下排引脚名称------------------
// NO.	1	2	3	4	5	6	7	8	9
//******************************************
// 上:	A1	A2	B	C	D2	D1	E	F	位控制
// 下:	H	I	J	G2	K	L	M	G1	DP
//-----------------------------------------------------------------
#define INT8U  unsigned char
#define INT16U unsigned int
#define INT32U unsigned long
#include <reg51.h>
#include <intrins.h>
#include <string.h>
sbit SDA = P2^0;			//数据线
sbit SCL = P2^1;			//时钟线
#include "I2C.h"			//IIC总线通用宏及函数
#define MAX6955R 0xC1		//1 = READ 
#define MAX6955W 0xC0		//0 = WRITE
//16段数码管滚动显示的字符串
char SEG_LED_String[] = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void delay_ms(INT16U x) {INT8U t; while(x--) for(t = 0; t<120; t++);}
//-----------------------------------------------------------------
// 写MAX6955子程序
//-----------------------------------------------------------------
void MAX6955_Write(INT8U addr, INT8U dat)
{


}

//-----------------------------------------------------------------
// MAX6955初始化
//-----------------------------------------------------------------
void MAX6955_INIT()
{


}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{



}