//-----------------------------------------------------------------
//	名称: SPI接口温度传感器TC72驱动程序
//-----------------------------------------------------------------
#include <reg51.h>
#include <intrins.h>
#include <stdio.h>
#include <math.h>
#define INT8U	unsigned char
#define INT16U	unsigned int
//TC72寄存器地址定义
#define TC72_CTRL		0x80	//控制寄存器
#define TC72_TEMP_LSB	0x01	//温度低字节
#define TC72_TEMP_MSB	0x02	//温度高字节
#define TC72_MANU_ID	0x03	//制造商ID
//SPI接口引脚定义(模拟方式)
sbit SCK = P3^4;				//串行时钟控制脚
sbit CE  = P3^5;				//片选
sbit SDI  = P3^6;				//串行数据输入
sbit SDO  = P3^7;				//串行数据输出
INT8U Temp_Value[2];			//两字节温度值原始数据
extern void delay_ms(INT16U x);
//-----------------------------------------------------------------
// 从当前地址读取一字节数据(模拟方式)
//-----------------------------------------------------------------
INT8U _ReadByte()
{


}

//-----------------------------------------------------------------
// 向当前地址写入一字节数据(模拟方式)
//-----------------------------------------------------------------
void _WriteByte(INT8U dat)
{


}

//-----------------------------------------------------------------
// 向TC72写入两字节(地址,数据)(模拟方式)
//-----------------------------------------------------------------
void Write_TC72(INT8U addr, INT8U dat)
{


}

//-----------------------------------------------------------------
// 写TC72配置数据
//-----------------------------------------------------------------
void Config_TC72()
{
	Write_TC72(TC72_CTRL,0x15);	//配置为单次转换与关断模式
}

//-----------------------------------------------------------------
// 从TC72读取两字节温度数据并转换为浮点温度值
//-----------------------------------------------------------------
float Read_TC72_Temperature()
{


}
