//-----------------------------------------------------------------
//  名称: T6963C液晶中文显示温度与时间
//-----------------------------------------------------------------
//  说明：运行本例时，液晶屏将实时显示当前日期,时间,温度信息.
//								  
//-----------------------------------------------------------------
#include <intrins.h>
#include <string.h>
#include <lcd_160128.h>
//星期的中文对照表
char code *WeeksTable[] = {"日","一","二","三","四","五","六"};
extern INT8U DateTime[];			//所读取的日期时间
extern INT8U Temp_Value[];			//所读取的温度值原始数据
extern void GetDateTime();			//读取日期时间
extern INT8U Read_Temperature();	//读取温度原始字节数据
char disp_buff[13];					//字符串显示缓冲
extern void LCD_Initialise();		//液晶初始化
									//在LCD指定位置显示信息
extern void Display_Str_at_xy(INT8U,INT8U,char *) reentrant;
extern delay_ms(INT16U);			//延时函数
//-----------------------------------------------------------------
// 定时器0每秒刷新LCD显示	 
//-----------------------------------------------------------------
void T0_INT() interrupt 1 
{


}

//-----------------------------------------------------------------
// 主程序	 
//-----------------------------------------------------------------
void main()
{


}