//-----------------------------------------------------------------
//  名称: TIMER0控制数码管动态管显示
//-----------------------------------------------------------------
//  说明: 8个数码管上分两组动态显示年月日与时分秒,本例的位显示延时
//		用定时器实现,未使用前面案例中常用的延时函数
//	 
//-----------------------------------------------------------------
#include <reg51.h>
#include <intrins.h>
#define INT8U  unsigned char
#define INT16U unsigned int
//0-9的数码管段码,最后一位是"-"的段码,索引为10
INT8U code DSY_CODE[]=
{ 0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90,0xBF};
//待显示数据09-12-25与24-18-35(分为两组显示)
INT8U code Table_OF_Digits[][8] = 
{  {0,9,10,1,2,10,2,5},
   {2,1,10,5,7,10,3,9}
};
INT8U i = 0,j = 0;
INT16U t = 0; 

//------------------------------------------------------------------
// 主程序(方法1,使用定时器中断控制数码刷新显示)
//------------------------------------------------------------------
void main() 
{  
	TMOD = 0x01;				//T0工作于方式1；
	TH0 = (65536 - 4000) >> 8;	//4ms 定时；
	TL0 = (65536 - 4000) &0xFF;
	IE = 0x82;					//使能T0中断；
	TR0 = 1;					//启动T0；
	while(1);					//主程序等待中断；

}
 
//------------------------------------------------------------------
// T0中断控制数码管刷新显示
//------------------------------------------------------------------
void DSY_Show() interrupt 1 
{
	TH0 = (65536 - 4000) >> 8;	//重装4ms 定时；
	TL0 = (65536 - 4000) &0xFF;	
	P0 = 0xFF;					//暂时关闭段码；
	P2 = ~(1 << j);				//输出位码；
	P0 = DSY_CODE[Table_OF_Digits[i][j]];	//输出段码；
	j = (j + 1)	% 8;			//数组第i行的下一数字索引；
	if( ++t != 350 )  			//每组的8个字符位保持刷新一段时间
		return;
	t = 0;						//刷新若干遍数后切换；
	i = (i + 1) % 2;			//数组行i=0时显示年月日，i=1时显示时分秒；

}
/*
//------------------------------------------------------------------
// 主程序(方法2,不使用定时器中断控制数码刷新显示)
//------------------------------------------------------------------
void main() 
{  
	TMOD = 0x01;				//T0 工作方式1；
	TH0 = (65536 - 4000) >> 8;	//4ms 定时；
	TL0 = (65536 - 4000) &0xFF;
	IE = 0x82；					//使能T0中断；
	TR0 = 1；					//启动T0；
	while(1)
	{
		if(TF0)
		{
			TF0 = 0;
			TH0 = (65536 - 4000) >> 8;	//4ms 定时；
			TL0 = (65536 - 4000) &0xFF;
			P0 = 0xFF;					//暂时关闭段码；
			P2 = ~(1 << j);				//输出位码
			P0 = DSY_CODE[Table_OF_Digits[i][j]];	   //输出段码；
			j = (j + 1) % 8;			//数组第i行的下一数字索引；
			if( ++t != 350 )			//每组的8个字符位保持刷新一段时间；
				continue;
			t = 0;						//刷新若干遍数后切换；
			i = (i + 1) % 2;			//数组i=0行时显示年月日，i=1时显示时分秒；
		}
	}

}*/
