//-----------------------------------------------------------------
//  名称: 1-Wire总线可寻址开关DS2405应用测试
//-----------------------------------------------------------------
//  说明: 本例使用了1-Wire式可寻址开关器件DS2405,连接单片机的三个
//		按键可通过单片机分别控制三个继电器的开关.
//
//-----------------------------------------------------------------
#include <reg51.h>
#include <intrins.h>
#include <stdio.h>
#define INT8U  unsigned char
#define INT16U unsigned int
#include "DS2405.h"
//三只DS2405的ROMCODE(提前读取)
const INT8U DS2405_ROMCODE[][8] =
{ {0x05,0xC5,0xC3,0x08,0x00,0x00,0x00,0xCD},
  {0x05,0xB3,0xBF,0x08,0x00,0x00,0x00,0xAB},
  {0x05,0xB4,0xBF,0x08,0x00,0x00,0x00,0x2E}
}; 
//按键定义
#define K1_DOWN() ((P1 & (1<<0)) == 0x00)
#define K2_DOWN() ((P1 & (1<<3)) == 0x00)
#define K3_DOWN() ((P1 & (1<<6)) == 0x00)
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{


}
