//-----------------------------------------------------------------
// 名称：24C08 IIC读写程序 
//-----------------------------------------------------------------
#define INT8U  unsigned char
#define INT16U unsigned int
#include <reg51.h>
#include <intrins.h>
sbit SCL = P3^2;			//串行时钟
sbit SDA = P3^3;			//串行数据
#include "I2C.h"			//IIC总线通用宏及函数
//-----------------------------------------------------------------
// 发送多字节(页写,每次不超过16字节)
//-----------------------------------------------------------------
void SendString(INT8U DEV_Addr, INT16U MEM_Addr,INT8U *Buffer,INT8U N)
{


}

//-----------------------------------------------------------------
// 接收多字节
//-----------------------------------------------------------------
void RecString(INT8U DEV_Addr,INT16U MEM_Addr,INT8U *Buffer,INT8U N)
{



}