//-----------------------------------------------------------------
//  名称: I2C接口PCF8591驱动程序
//-----------------------------------------------------------------
#define INT8U  unsigned char
#define INT16U unsigned int
#define INT32U unsigned long
#include <reg51.h>
#include <intrins.h>
sbit SCL	= P1^0; 			//I2C时钟引脚
sbit SDA	= P1^1; 			//I2C数据输入输出引脚
#include "I2C.h"				//IIC总线通用宏及函数
//-----------------------------------------------------------------
// 连续读入4路通道的A/D转换结果并保存到缓冲R
//-----------------------------------------------------------------
void ADC_PCF8591(INT8U CtrlByte, INT8U *R)
{ 



}

//-----------------------------------------------------------------
// 向PCF8591发送1字节,进行D/A转换
//-----------------------------------------------------------------
void DAC_PCF8591(INT8U CtrlByte,INT8U dat)
{	



}