//-----------------------------------------------------------------
//  名称: ADC0808 PWM实验
//-----------------------------------------------------------------
//  说明: 本例使用了模数转换芯片ADC0808,通过调节可变电阻RV1来调节
//		占空比,运行程序时打开VSM Oscilloscope即可观察占空比的变化.
//
//-----------------------------------------------------------------
#include <reg51.h>
#define INT8U  unsigned char
#define INT16U unsigned int
sbit CLK  = P2^4;		//时钟线
sbit ST	= P2^5;			//启动转换
sbit EOC  = P2^6;		//转换结束
sbit OE	= P2^7;			//输出使能控制线
sbit PWM  = P3^0;		//PWM输出
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void delay_ms(INT16U x) 
{
	INT8U t; while(x--) for(t = 0; t < 120; t++);
}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{
	INT8U Val;
	TMOD = 0x02;					//定时器配置为模式2(8位自动重装模式)
	TH0  = -250;					//定时初值为250
	TL0  = -250;					//计数工作寄存器,溢出时由TH0自动重新装入
	IE	= 0x82;						//使能TIMER0溢出中断
	TR0 = 1;						//启动TIMER0
	while (1)
	{	



	} 
}

//-----------------------------------------------------------------
// T0定时器溢出中断提供A/D转换时钟,频率:1/250/2*10000000=2000HZ
//-----------------------------------------------------------------
void  Timer0_INT() interrupt 1
{

}