//-----------------------------------------------------------------
// 名称: ADC0832模数转换程序
//-----------------------------------------------------------------
#include <intrins.h>
#include <reg51.h>
#define INT8U unsigned char
#define INT16U unsigned int
sbit  DIO	=  P0^0;	//数据线
sbit  CLK	=  P0^1;	//时钟钟线
sbit  CS	=  P0^2;	//片选线
//-----------------------------------------------------------------
// 获取指定通道的A/D转换结果
//-----------------------------------------------------------------
INT8U Get_CHx_AD_Value(INT8U ch)
{


}