//-----------------------------------------------------------------
//  名称：74HC138译码器与反向缓冲器控制数码管显示
//-----------------------------------------------------------------
//  说明：本例用3-8译码器控制数码管位码,仅占用P2端口低3位引脚.
//        用反向缓冲/驱动器7406驱动显示.
//
//-----------------------------------------------------------------
#include<reg51.h>
#include<intrins.h>
#define INT8U  unsigned char
#define INT16U unsigned int
//共阳数码管段码表
INT8U code SEG_CODE[]={0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90 };
//待显示数据
INT8U disp_buff[] = {2,0,2,0,0,3,2,2};
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void delay_ms(INT16U x) 
{
	INT8U t; while(x--) for(t = 0; t < 120; t++);
}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{
    INT8U i;
    while(1)
    {
        for(i=0; i<8; i++)
        {
            P0 = 0xFF;                      //暂时关闭段码
            P2 = i;                         //通过38译码器输出位码
            P0 = SEG_CODE[disp_buff[i]];    //输出段码
            delay_ms(4);                
        }
    }
}