//-----------------------------------------------------------------
//  名称: 数码管BCD解码驱动器CD4511与DM7447应用
//-----------------------------------------------------------------
//  说明: BCD码经CD4511或DM7447译码后输出数码管段码，实现数码管显示
//		（7447驱动共阳数码管,本例用的是共阴数码管,用4511直接驱动）
//
//-----------------------------------------------------------------
#include <reg51.h>
#include <intrins.h>
#define INT8U  unsigned char
#define INT16U unsigned int
//待显示的数字串"87 69 03",其中0xFF不显示
code INT8U BCD_CODE[] = {8,7,0xFF,6,9,0xFF,0,3,};
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void delay_ms(INT16U x) 
{
	INT8U t; while(x--) for(t = 0; t < 120; t++);
}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{
	INT8U i;
	while(1)
	{
		for(i=0; i<8; i++)	//8位数据发送CD4511解码显示
		{
			//译码器输出0~7对应的扫描码
			P3 = i;
			//向CD4511输出待显示数字的BCD码（非段码）
			P1 = BCD_CODE[i];
			delay_ms(4);
		}
	}
}