//-----------------------------------------------------------------
// 名称: ADC0832模数转换程序
//-----------------------------------------------------------------
#include <reg51.h>
#include <intrins.h>
#include <string.h>
#define INT8U  unsigned char
#define INT16U unsigned int
//ADC0832引脚定义
sbit CS   =  P1^1;	//片选线(电路中固定连接低电平)
sbit CLK  =  P1^4;	//时钟钟线
sbit DIO  =  P1^5;	//数据线
//-----------------------------------------------------------------
// 获取AD转换结果 ( 0通道 )
//-----------------------------------------------------------------
INT8U Get_AD_Result()
{

}