//-----------------------------------------------------------------
//  名称: 直流电机正反转及PWM调速控制
//-----------------------------------------------------------------
//  说明: 本例SW1的三个档位用于设置电机正、反转及停转，K1、K2用于控制
//	  电机PWM调速,在进行相应操作时,对应的LED被点亮.
//
//-----------------------------------------------------------------
#include <reg51.h>
#include <intrins.h>
#define INT8U  unsigned char
#define INT16U unsigned int
#define S1_ON() (P3 & (1<<5)) == 0x00 //正转
#define S2_ON() (P3 & (1<<6)) == 0x00 //停转
#define S3_ON() (P3 & (1<<7)) == 0x00 //反转
#define Forward		0	//正转指示灯
#define Stop		1	//停转指示灯
#define Backward	2	//反转指示灯
sbit M_DIR = P1^0; 		//方向控制
sbit M_PWM = P1^1;		//PWM调速控制
sbit Key_INC = P3^0;	//加速键
sbit Key_DEC = P3^1;	//减速键
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void delay_us(INT16U x) { for(; x>0; x--) _nop_(); }
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{





}