//-----------------------------------------------------------------
//  名称: 集成式数码管动态扫描显示
//-----------------------------------------------------------------
//  说明: 本例使用动态扫描显示方法在8位数码管上显示指定数组内容
//	
//-----------------------------------------------------------------
#include <reg51.h>
#define INT8U	unsigned char
#define INT16U  unsigned int
//共阳数码管0~9的数字段码表
code INT8U SEG_CODE[] = {0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90};
//待显示到数码管的8个数字
code INT8U array[] = {2,0,1,2,1,2,1,5} ;
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void delay_ms(INT16U x) 
{
	INT8U t; while(x--) for(t = 0; t < 120; t++);
}

//-----------------------------------------------------------------
// 主程序	  
//-----------------------------------------------------------------
void main()
{
    INT8U i;  
    while (1)
    {
         for(i=0;i<8;i++)                //循环扫描显示8位数码管；
        {
            P0 = 0xFF;                     //暂时关闭段码消影；
            P2 = 1 << i;              //输出扫描位码；
            P0 = SEG_CODE[array[i]];    //输出数字array[i]的段码；
            delay_ms(4);               //延时消影；
        }
    }
}