//-----------------------------------------------------------------
//  名称: SPI接口存储器AT25F4096读写与显示
//-----------------------------------------------------------------
#include <reg52.h>
#include <intrins.h>
#include <stdlib.h>
#define INT8U  unsigned char
#define INT16U unsigned int
#define INT32U unsigned long
//SPI接口存储器引脚定义
sbit SCK = P3^2;				//串行时钟控制脚
sbit SI  = P3^3;				//串行数据输入
sbit SO  = P3^4;				//串行数据输出
sbit CS  = P3^5;				//片选
//SPI接口存储器操作命令定义
#define WREN			0x06	//使能写
#define WRDI			0x04	//禁止写
#define RDSR			0x05	//读状态
#define WRSR			0x01	//写状态
#define READ			0x03	//读字节
#define WRITE			0x02	//写字节
#define SECTOR_ERASE	0x52	//删除区域数据
#define CHIP_ERASE		0x62	//删除芯片数据
#define RDID			0x15	//读厂商与产品ID
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void delay_ms(INT8U x) {INT8U t; while(x--) for(t = 0; t<120; t++);}
//-----------------------------------------------------------------
// 从当前地址读取一字节数据
//-----------------------------------------------------------------
INT8U ReadByte()
{


}

//-----------------------------------------------------------------
// 向当前地址写入一字节数据
//-----------------------------------------------------------------
void WriteByte(INT8U dat)
{


}

//-----------------------------------------------------------------
// 读AT25F4096A芯片状态
//-----------------------------------------------------------------
INT8U Read_SPI_Status()
{


}

//-----------------------------------------------------------------
// AT25F4096A忙等待
//-----------------------------------------------------------------
//void Busy_Wait(){ while(Read_SPI_Status() & 0x01);}	//忙等待
//-----------------------------------------------------------------
// 向AT25F4096A写入三个字节的地址0x000000-0x01FFFF 
//-----------------------------------------------------------------
void Write_3_Bytes_SPI_Address(INT32U addr)
{


}

//-----------------------------------------------------------------
// 从指定地址读单字节
//-----------------------------------------------------------------
//INT8U Read_Byte_From_AT25F4096A(INT32U addr)
//{
//}

//-----------------------------------------------------------------
// 从指定地址读多字节到缓冲
//-----------------------------------------------------------------
void Read_Bytes_From_AT25F4096A(INT32U addr, INT8U *p, INT16U len)
{

}