//-----------------------------------------------------------------
//  名称: 可接收串口信息的带中英文硬字库的80x16LED点阵屏
//-----------------------------------------------------------------
//  说明: 本例运行时,点阵屏将滚动显示一组固定信息
//	当接收到串口发送来的中英文/全角/半角字符时,点屏将开始
//	滚动显示所接收到的信息.
//				  
//-----------------------------------------------------------------
#include <reg51.h>
#include <intrins.h>
#include <string.h>
#define INT8	signed	char
#define INT8U	unsigned char
#define INT16U  unsigned int
#define INT32U  unsigned long
//74595相关引脚定义
sbit DS 	= P1^5;
sbit SH_CP	= P1^6;
sbit ST_CP	= P1^7;
//74154译码器使能与禁止
#define EN_74HC154()  P1 &= ~(1<<4)
#define DI_74HC154()  P1 |=  (1<<4)
//SPI相关函数
extern void Read_Bytes_From_AT25F4096A(INT32U, INT8U*, INT16U);
extern void delay_ms(INT16U);
#define MAX_WORD_COUNT 	50						//允许的最大汉字个数
//初始演示中英文字符串:"★LED点阵演示V1.0★"
//后续从串口接收的中英文信息将添加或覆盖保存到Buffer
INT8U xdata Buffer[MAX_WORD_COUNT*2 + 2] = "★LED点阵演示V1.0★";
INT8U xdata Buffer_Len;							//缓冲有效字符长度
INT8U xdata Dot_Matrix[MAX_WORD_COUNT * 32];	//待显示点阵数据缓冲
INT8U xdata Rec_END_Flag = 0;					//接收结束标志
//-----------------------------------------------------------------
// 串口初始化
//-----------------------------------------------------------------
void Serial_port_init()
{


}

//-----------------------------------------------------------------
// 串行输入子程序
//-----------------------------------------------------------------
void Serial_In595(INT8U dat)
{


}

//-----------------------------------------------------------------
// 并行输出子程序
//-----------------------------------------------------------------
void Parallel_Output_595()
{


}

//-----------------------------------------------------------------
// 根据Buffer缓冲的字符,从硬字库读取点阵数据并转换为LED要求的格式
//-----------------------------------------------------------------
void Read_SPI_ZK_and_Convert()
{  



}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{



}

//------------------------------------------------------------------
// 串口接收中断程序
//------------------------------------------------------------------
void receive_4_digit() interrupt 4
{



}