//-----------------------------------------------------------------
//  名称: I2C接口温度传感器DS1621应用测试
//-----------------------------------------------------------------
//  说明: 传感器可检测温度范围为-55.0℃- 125.0℃.
//		程序运行过程中,可通过动态调节温度来模拟外界温度变化,
//		本例中温度通过虚拟终端显示,当模拟外界温度超过上限时,
//		Tout将呈现高电平,继电器吸合,直到温度重新下降到TL之下时,
//		Tout才呈现低电平,断电器断开.
//
//-----------------------------------------------------------------
#define INT8U  unsigned char
#define INT16U unsigned int
#define INT32U unsigned long
#include <reg51.h>
#include <intrins.h>
#include <string.h>
#include <stdio.h>
code char Prompt[] = "IIC_Starting...\r";	//初始提示语句
#define SUB_DEV_ADDR 0x90					//DS1621子器件地址
extern INT8U d[];							//读取的温度原始数据
extern INT8U d[2];							//读取两字节温度数据
extern INT8U SET_CONFIG[];					//写配置字节
extern INT8U SET_TH[];						//设置TH
extern INT8U SET_TL[];						//设置TL
extern INT8U IIC_Start_CONV[];				//启动转换
extern void Write_DS1621(INT8U Slave_Addr,INT8U *Buff, INT8U n);
extern void Read_Temp(INT8U Slave_Addr);
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void delay_ms(INT16U x) {INT8U t; while(x--) for(t = 0; t<120; t++);}
//-----------------------------------------------------------------
// 初始化串口
//-----------------------------------------------------------------
void Initialise_USART(){ TMOD = 0x20; TH1  = 0xFD; SCON = 0x50; TR1 = 1;}
//-----------------------------------------------------------------
// 向串口发送一个字符
//-----------------------------------------------------------------
void putChar(INT8U ch)	{ SBUF = ch; while( !TI ); TI = 0;	}
//-----------------------------------------------------------------
// 向串口发送读取的温度
//-----------------------------------------------------------------
void USART_Show()
{


}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{



}