//-----------------------------------------------------------------
// 名称: ADC0832模数转换程序
//-----------------------------------------------------------------
#include <intrins.h>
#include <reg51.h>
#define INT8U unsigned char
#define INT16U unsigned int
sbit CLK	= P1^0;
sbit DIO	= P1^1;
sbit CS  	= P1^3;
//-----------------------------------------------------------------
// 获取指定通道的A/D转换结果
//-----------------------------------------------------------------
INT8U Get_CHx_AD_Value(INT8U ch)
{


}