//-----------------------------------------------------------------
//  名称:T6963C 液晶曲线显示ADC0832两路模数转换结果
//-----------------------------------------------------------------
//  说明:运行本例时,两路模数转换结果将以曲线形式显示在液晶屏上.
//
//-----------------------------------------------------------------
#include <T6963C.h>
#include <stdio.h>
#include <math.h>
extern void LCD_Initialise(); 
extern void Display_Str_at_xy(INT8U x,INT8U y,char *Buffer);
extern INT8U Get_CHx_AD_Value(INT8U ch);
extern void Line(INT8U x1,INT8U y1, INT8U x2,INT8U y2, bit Mode);
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{


}