//-----------------------------------------------------------------
//  名称: ADC0832模数转换与显示
//-----------------------------------------------------------------
//  说明: 调整VR1时,ADC0832将模拟电压转换为数字电压显示在1602液晶
//        屏第0行,液晶屏第1行同时以进程条方式显示当前电压大小.
//
//-----------------------------------------------------------------
#include <reg51.h>
#include <intrins.h>
#include <string.h>
#define INT8U  unsigned char
#define INT16U unsigned int
//ADC0832引脚定义
sbit CS   =  P1^0;		//片选线(电路中固定连接低电平)
sbit CLK  =  P1^1;		//时钟线
sbit DIO  =  P1^2;		//数据线
//LCD1602端口定义
sbit RS = P2^0;			//寄存器选择
sbit RW = P2^1;			//读写控制
sbit E  = P2^2;			//使能控制
#define LCD_PORT  P0	//液晶端口
INT8U Disp_Buff1[] = " VOLTAGE:  0.00V";	//数字电压显示缓冲
INT8U Disp_Buff2[16];						//进程条图形显示缓冲
#define delay4us() { _nop_();_nop_();_nop_();_nop_();}
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void delay_ms(INT16U x) 
{
	INT8U t; while(x--) for(t = 0; t < 120; t++);
}

//-----------------------------------------------------------------
// 读LCD忙状态
//-----------------------------------------------------------------
bit Read_LCD_Busy_Flag()
{

}

//-----------------------------------------------------------------
// 写LCD命令
//-----------------------------------------------------------------
void Write_LCD_Command(INT8U cmd)
{

}

//-----------------------------------------------------------------
// 写LCD数据
//-----------------------------------------------------------------
void Write_LCD_Data(INT8U dat)
{

}

//-----------------------------------------------------------------
// 在LCD指定行/列位置显示字符串
//-----------------------------------------------------------------
void LCD_Show_String(INT8U r,INT8U c, char *s)
{

}

//-----------------------------------------------------------------
// LCD初始化 
//-----------------------------------------------------------------
void LCD_Initialise()
{
	Write_LCD_Command(0x38); delay_ms(1);
	Write_LCD_Command(0x0C); delay_ms(1);
	Write_LCD_Command(0x06); delay_ms(1);
	Write_LCD_Command(0x01); delay_ms(1);
}

//-----------------------------------------------------------------
// 获取AD转换结果 ( 0通道 )
//-----------------------------------------------------------------
INT8U Get_AD_Result()
{

}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{
	INT8U i, AD; INT16U	d;		//注意d的类型为INT16U
	LCD_Initialise();			//初始化LCD
	while(1)
	{	


	}
}
