//-----------------------------------------------------------------
//  名称: TG126410液晶串行模式演示
//-----------------------------------------------------------------
//  说明: 本例用按键与开关控制TG126410显示不同画面,LCD工作于串行模式.
//		本例所显示的几幅画面常用于对液晶屏进行显示测试.
//			   
//-----------------------------------------------------------------
#include <reg51.h>
#include <intrins.h>
#define INT8U  unsigned char
#define INT16U unsigned int
//按键定义
sbit K1 = P1^0;  //前翻
sbit K2 = P1^3;  //后翻
sbit K3 = P1^6;  //自动刷新
//画面总数及当前画面页索引
INT8U MaxPage = 7, CurrPageIDX = 0;
//控制是否继续显示下一幅图像的标识变量
enum {FALSE,TRUE} ShowNext = FALSE;
//12864LCD显示与屏幕测试相关函数
extern void LCD_Initialize();
extern void Full_Disp_ON_OFF(INT8U k);
extern void Disp_Checker(INT8U k);
extern void Disp_Frame();
extern void Disp_R();
extern void Disp_Clip();
extern void Disp_Picture();
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void delay_ms(INT16U x) 
{
	INT8U t; while(x--) for(t = 0; t < 120; t++);
}

//-----------------------------------------------------------------
// 按键扫描
//-----------------------------------------------------------------
void Scan_KEYs()
{


}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{
	LCD_Initialize(); _delay_ms(5);		//液晶初始化
	Full_Disp_ON_OFF(0);				//全屏不显示
	delay_ms(200);
	Full_Disp_ON_OFF(1);				//全显(形成全黑色屏幕)
	while (1)
	{	

	}
}