//-----------------------------------------------------------------
//  名称: 温室控制系统仿真设计
//-----------------------------------------------------------------
//  说明: K1~K3按键分别控制通风、采光及水泵电机开关,LCD显示当前温度值.
//        上位机按钮可分别实现K1~K3的控制功能,系统运行时,下位机温度值
//        将刷新显示在上位机C#窗体中.
//
//-----------------------------------------------------------------
#include <reg51.h>
#include <intrins.h>
#include <string.h>
#include <stdio.h>
#define INT8U	unsigned char
#define INT16U	unsigned int
#define MAX_CHAR 11						//允许接收并保存的最大字符个数
volatile INT8U recv_buff[MAX_CHAR+1];	//串口接收缓冲
volatile INT8U Buf_Index = 0;			//缓冲索引
extern INT8U Read_Temperature();		//读传感器温度函数
extern void LCD_Initialize();			//LCD初始化函数
extern void LCD_ShowString(INT8U , INT8U,INT8U *);//在指定行/列显示字符串函数
extern INT8U Temp_Value[];				//从DS18B20读取的数据
extern void delay_ms(INT16U x);			//延时函数
char Disp_Buffer[17];					//LCD显示缓冲
volatile INT8U recv_OK = 0;				//上位机命令串接收成功标识
//相关按键、控制引脚等定义
sbit K1 = P1^5;							//通风电机开关控制按键
sbit K2 = P1^6;							//采光电机开关控制按键
sbit K3 = P1^7;							//水泵开关控制按键
sbit F_IN1 = P1^0;						//通风电机控制端
sbit F_IN2 = P1^1;
sbit F_IN3 = P1^2;						//采光电机控制端
sbit F_IN4 = P1^3;
sbit RELAY = P2^4;						//水泵控制继电器
sbit LED_1 = P2^5;						//通风电机开关指示灯
sbit LED_2 = P2^6;						//采光电机开关指示灯
sbit LED_3 = P2^7;						//水泵指示灯
//-----------------------------------------------------------------
// 串口输出字符串
//-----------------------------------------------------------------
void PutStr(char *s)
{


}

//-----------------------------------------------------------------
// 主函数
//-----------------------------------------------------------------
void main()
{


}

//-----------------------------------------------------------------
// INT0中断函数
//-----------------------------------------------------------------
void INT0_ISR() interrupt 0 
{


}

//-----------------------------------------------------------------
// 串口接收中断函数
//-----------------------------------------------------------------
void Serial_INT_ISR() interrupt 4 
{


}