//-----------------------------------------------------------------
//  名称: 1602LCD显示仿手机键盘按键字符
//-----------------------------------------------------------------
//  说明: 按下仿手机矩阵键盘按键时,对应按键字符显示在1602LCD上
//
//-----------------------------------------------------------------
#include "LCD1602-4bit.h"
#include <string.h>
#define INT8U unsigned char
#define INT16U  unsigned int
sbit SPK = P3^7;
//12个键盘按键字符总表
//注意串空间应设为6字节,因为最长串为5,设为5时会使部分长串无法附带串结束标志'\0'
INT8U code Keypad_Chars[12][6] = 
{	"1 ",	"2ABC",	"3DEF",
	"4GHI",	"5JKL",	"6MNO",
	"7PQRS","8TUV",	"9WXYZ",
	"*",	"0+",	"#"
};
extern INT8U KeyNo;		//键值
INT8U Inner_Idx = 0;	//同一按键的内部字符索引
INT8U tSpan = 0;		//同键位连续按键的时间间隔
INT8U Buffer_Index = 0; //英文/数字输入缓冲索引
char  Input_Buffer[16]; //输入缓冲空间
INT8U ENG_TEL = 1;		//输入内容切换标识(ENG:英文输入,TEL:电话输入)
extern void delay_ms(INT16U ms);
extern INT8U KeyMatrix_Down();
extern void Keys_Scan();
//-----------------------------------------------------------------
// 蜂鸣器
//-----------------------------------------------------------------
void Beep()
{



}

//-----------------------------------------------------------------
// 定时器0跟踪同位按键的时间间隔 
//-----------------------------------------------------------------
void T0_INT() interrupt 1
{



}

//-----------------------------------------------------------------
// 功能键处理 *(9):切换输入,#(11)键清除内容
//-----------------------------------------------------------------
void Function_Key_Process()
{



}

//-----------------------------------------------------------------
// 主程序 
//-----------------------------------------------------------------
void main()
{



}