//-----------------------------------------------------------------
//  名称: 用兼容I2C接口的MAX6953驱动4片5x7点阵显示器
//-----------------------------------------------------------------
//  说明: 本例运行时,四块点阵屏将滚动显示一组信息串,信息串中的字符
//		点阵信息由MAX6953提供,本例不需要为各字符单独提供字模点阵.
//		运行过程中通过按键命令可随时关断或开启6953.
//
//-----------------------------------------------------------------
#define INT8U  unsigned char
#define INT16U unsigned int
#define INT32U unsigned long
#include <reg51.h>
#include <intrins.h>
#include <intrins.h>
#include <string.h>
sbit SDA = P3^5;			//数据线
sbit SCL = P3^6;			//时钟线
#include "I2C.h"			//IIC总线通用宏及函数
//子器件地址
#define MAX6953R 0xA1		//1 = READ
#define MAX6953W 0xA0		//0 = WRITE
//四块点阵屏滚动显示的信息串
char LED_String[] = "5*7LED TEST : <----0123456789";
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void delay_ms(INT16U x) {INT8U t; while(x--) for(t = 0; t<120; t++);}
//-----------------------------------------------------------------
// 写MAX6953子程序
//-----------------------------------------------------------------
void MAX6953_Write(INT8U addr, INT8U dat)
{



}

//-----------------------------------------------------------------
// MAX6953初始化
//-----------------------------------------------------------------
void MAX6953_INIT()
{



}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{



}

//-----------------------------------------------------------------
// INT0中断函数控制点阵屏关断或开启
//-----------------------------------------------------------------
void EX_INT0() interrupt 0 
{



}
