//-----------------------------------------------------------------
//  名称: 用T6963C液晶设计的指针式电子钟
//-----------------------------------------------------------------
//  说明:本例利用像素可寻址的LCD设计了指针式电子钟,电子钟由表盘、
//		时针、分针、秒针等构成.
//
//-----------------------------------------------------------------
#include <LCD_12864.h>
#include <stdio.h>
#include <math.h>
#define PI 3.1415926
sbit SDA = P1^0;	//DS1302数据线
sbit CLK = P1^1;	//DS1302时钟线
sbit RST = P1^2;	//DS1302复位线
sbit K1 = P3^0;		//选择 
sbit K2 = P3^1;		//调整
sbit K3 = P3^3;		//确定
INT8U tCount = 0, d_Flag = 0;
INT8U Current_Time[7];			//所读取的日期时间
char Adjust_Index = -1;			//当前调节的时间对象:秒,分,时(0,1,2)
extern void cls();				//清屏
extern char LCD_Initialise();	//LCD初始化
//写无参数的命令
extern INT8U LCD_Write_Command(INT8U cmd);
//写双参数命令
extern INT8U LCD_Write_Command_P2(INT8U ,INT8U ,INT8U );
extern INT8U LCD_Write_Data(INT8U dat);				//写数据
extern void Set_LCD_POS(INT8U , INT8U ) reentrant;	//设置当前地址
//画水平线函数
extern void Line(INT8U x1, INT8U y1, INT8U x2, INT8U y2, bit Mode);
extern void Pixel(INT8U ,INT8U , INT8U ) reentrant ;//画点函数
//秒,分,时变化以后的备份,用于避免时针与分针在每秒时均被重画,以至形成抖动
INT8U Time_Back[] = {-1,-1,-1};
INT8U HMS_Hand_Length[] = {24,20,15}; //秒,分,时针的长度
//-----------------------------------------------------------------
// 绘制电子钟圆形面板
//-----------------------------------------------------------------
void Clock_Plate()
{


}

//-----------------------------------------------------------------
// 重绘HMS中的某一指针(参数0,1,2分别为秒,分,时)
//-----------------------------------------------------------------
void Repaint_A_Hand(INT8U i) 
{


}

//-----------------------------------------------------------------
// 时间变化时重绘
// 秒针与分针时钟接近重叠,或分钟与时针接近重叠时也重绘
//-----------------------------------------------------------------
void Display_HMS_Hand()
{


}

//-----------------------------------------------------------------
// 向DS1302写入一字节
//-----------------------------------------------------------------
void Write_one_byte(INT8U x) 
{ 


}

//-----------------------------------------------------------------
// 从DS1302读取一字节BCD码并转换为十进制数	 
//-----------------------------------------------------------------
INT8U Get_one_byte() 
{ 


}

//-----------------------------------------------------------------
// 从DS1302指定位置读数据
//-----------------------------------------------------------------
INT8U Read_Data(INT8U addr)
{


}

//-----------------------------------------------------------------
// 向DS1302某地址写入数据
//-----------------------------------------------------------------
void Write_DS1302(INT8U addr,INT8U dat)
{


}

//-----------------------------------------------------------------
// 设置时间
//-----------------------------------------------------------------
void SET_DS1302() 
{


}

//-----------------------------------------------------------------	
// 读取当前时间(秒,分,时)
//-----------------------------------------------------------------
void GetTime() 
{


}

//-----------------------------------------------------------------
// 定时器0每秒刷新LCD显示
//-----------------------------------------------------------------
void T0_INT() interrupt 1 
{

	
}

//-----------------------------------------------------------------	
// 主程序
//-----------------------------------------------------------------
void main()
{


}