//-----------------------------------------------------------------
// 名称: PCF8583实时时钟驱动程序
//-----------------------------------------------------------------
#define INT8U  unsigned char
#define INT16U unsigned int
#include <reg51.h>
#include <intrins.h>
#include <string.h>
sbit SCL = P2^6;					//IIC时钟线
sbit SDA = P2^7;					//IIC数据线
#include "I2C.h"					//IIC总线通用宏及函数
#include "PCF8583.h"				//日期时钟芯片驱动程序头文件
//0,1,2,3,4,5,6分别对应周日,周一至六
char WEEK[][4] = {"SUN","MON","TUS","WEN","THU","FRI","SAT"};
//所读取的PCF8583数据及转换后的日期时间数据
INT8U PCF8583_DATA[5],DateTime[7];
//-----------------------------------------------------------------
// 从PCF8583指定地址读多字节到buf缓冲
//-----------------------------------------------------------------
void Read_PCF8583(INT8U addr,INT8U *buf,INT8U n)
{

}

//-----------------------------------------------------------------
// 读取7字节PCF8583时钟数据并整理到DateTime数组
//-----------------------------------------------------------------
void GetDateTime()
{

}