//-----------------------------------------------------------------
//  名称: 液晶显示MPX4250压力值
//-----------------------------------------------------------------
//  说明: 本例运行时,压力传感器输出电压经模数转换及公式换算后,
//        12864液晶屏上将显示出当前压力.
//
//-----------------------------------------------------------------
#include <LCD_160128.h>
#include <stdio.h>
extern INT8U LCD_Initialise();
extern void Set_LCD_POS(unsigned char urow, unsigned char  ucol);
extern void Display_Str_at_xy(INT8U x,INT8U y,volatile char *Buffer);
extern INT8U Get_CHx_AD_Value(INT8U ch);
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main()
{


}